{
  "alora_invocation_tokens": null,
  "alpha_pattern": {},
  "arrow_config": null,
  "auto_mapping": {
    "base_model_class": "Transformer3DModel",
    "parent_library": "xvideo.models.mmdit.dit.models"
  },
  "base_model_name_or_path": null,
  "bias": "none",
  "corda_config": null,
  "ensure_weight_tying": false,
  "eva_config": null,
  "exclude_modules": null,
  "fan_in_fan_out": false,
  "inference_mode": true,
  "init_lora_weights": "gaussian",
  "layer_replication": null,
  "layers_pattern": null,
  "layers_to_transform": null,
  "loftq_config": {},
  "lora_alpha": 16,
  "lora_bias": false,
  "lora_dropout": 0.0,
  "megatron_config": null,
  "megatron_core": "megatron.core",
  "modules_to_save": null,
  "peft_type": "LORA",
  "peft_version": "0.18.1",
  "qalora_group_size": 16,
  "r": 16,
  "rank_pattern": {},
  "revision": null,
  "target_modules": [
    "add_q_proj",
    "to_q",
    "to_k",
    "to_add_out",
    "add_v_proj",
    "to_out.0",
    "img_mlp.net.0.proj",
    "to_v",
    "txt_mlp.net.2",
    "img_mod.1",
    "txt_mod.1",
    "img_mlp.net.2",
    "txt_mlp.net.0.proj",
    "add_k_proj"
  ],
  "target_parameters": null,
  "task_type": null,
  "trainable_token_indices": null,
  "use_dora": false,
  "use_qalora": false,
  "use_rslora": false
}